text = "Договір про Антарктику окреслив захист континенту та ефективно припинив напруженість над територіальними претензіями. Хоча договір не змушує будь-яку країну відмовитися від свого права на територіальні претензії або позбавляти суверенітет над цією землею, вона перешкоджає країнам-членам заявляти про ці вимоги через будь-яку мирну діяльність."
# Використана функція len для того щоб підрахувати кількість символів у тексті
charCount = len(text)
print("Кількість символів у тексті:", charCount)

# Використана функція split() для того щоб розділити речення на слова, щоб потім підрахувати їх.
words = text.split()
wordCount = len(words)
print("Кількість слів в тексті:", wordCount)

# Використана функція lower() для того, щоб увесь текст був у малому регістрі
lowRegText = text.lower()
print("Текст у малому регістрі: \n", lowRegText)
